#include <stdint.h>
#include <stdio.h>

#define TABLE_SIZE 34
const uint8_t table[TABLE_SIZE][2] = {
    {13, 2}, {21, 3}, {22, 0}, {19, 6}, {19, 1}, {19, 6}, {24, 4},
    {13, 5}, {21, 0}, {23, 6}, {21, 0}, {23, 3}, {21, 0}, {22, 6},
    {22, 5}, {19, 4}, {19, 0}, {24, 2}, {19, 4}, {15, 0}, {23, 5},
    {21, 3}, {23, 4}, {21, 0}, {22, 0}, {21, 3}, {21, 0}, {19, 1},
    {19, 6}, {23, 4}, {21, 0}, {22, 6}, {22, 5}, {25, 6},
};

int main() {
  char corrects[35];

  for (int i = 0; i < TABLE_SIZE; i++) {
    // char 타입이기 때문에 1바이트의 숫자값 256까지 반복
    for (int j = 0; j < 256; j++) {
      // 문제에서 검증하는 식과 동일한 방식으로 정답 유추
      uint64_t x = (uint8_t)j;
      // 5의 매직넘버 3435973837
      // y = x / 5 과 같다
      uint64_t y = (x * 3435973837) >> 34;
      // 7의 매직넘버 613566757
      // t = x / 7 과 같다
      uint64_t t = (x * 613566757) >> 32; 
      // z = x % 7 과 같다
      uint64_t z = x - ((((x - t) >> 1) + t) >> 2) * 7;

      // 테이블에 일치하는 y, z를 찾은 경우 corrects에 넣기
      if (y == table[i][0] && z == table[i][1]) {
        corrects[i] = x;
        break;
      }
    }
  }
  printf("%s\n", corrects);

  return 0;
}